Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.5.82/samv71b/edc/ATSAMV71N21B.PIC
      <edc:SFRDef edc:_addr="0x4002405C" edc:access="-------------rrrrrrrrrrrrrrrrrrr" edc:cname="US_LINBRR" edc:impl="0x7FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="LINCD" edc:desc="Clock Divider after Synchronization" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="LINFP" edc:desc="Fractional Part after Synchronization" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024060" edc:access="--------nnnnnnnn----------nnnnnn" edc:cname="US_LONMR" edc:impl="0xFF003F" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="COMMT" edc:desc="LON comm_type Parameter Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COLDET" edc:desc="LON Collision Detection Feature" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCOL" edc:desc="Terminate Frame upon Collision Notification" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CDTAIL" edc:desc="LON Collision Detection on Frame Tail" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAM" edc:desc="LON DMA Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCDS" edc:desc="LON Collision Detection Source" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xA"/>
            <edc:SFRFieldDef edc:cname="EOFS" edc:desc="End of Frame Condition Size" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024064" edc:access="------------------nnnnnnnnnnnnnn" edc:cname="US_LONPR" edc:impl="0x3FFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="LONPL" edc:desc="LON Preamble Length" edc:nzwidth="0xE"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024068" edc:access="------------------------nnnnnnnn" edc:cname="US_LONDL" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="LONDL" edc:desc="LON Data Length" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002406C" edc:access="------------------------nnnnnnnn" edc:cname="US_LONL2HDR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="BLI" edc:desc="LON Backlog Increment" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="ALTP" edc:desc="LON Alternate Path Bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PB" edc:desc="LON Priority Bit" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024070" edc:access="--------------------------rrrrrr" edc:cname="US_LONBL" edc:impl="0x3F" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="LONBL" edc:desc="LON Node Backlog Value" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024074" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_LONB1TX" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="BETA1TX" edc:desc="LON Beta1 Length after Transmission" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024078" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_LONB1RX" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="BETA1RX" edc:desc="LON Beta1 Length after Reception" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002407C" edc:access="-----------------nnnnnnn-nnnnnnn" edc:cname="US_LONPRIO" edc:impl="0x7F7F" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="PSNB" edc:desc="LON Priority Slot Number" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NPS" edc:desc="LON Node Priority Slot" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024080" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_IDTTX" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="IDTTX" edc:desc="LON Indeterminate Time after Transmission (comm_type = 1 mode only)" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40024084" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_IDTRX" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART0">
            <edc:SFRFieldDef edc:cname="IDTRX" edc:desc="LON Indeterminate Time after Reception (comm_type = 1 mode only)" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
