Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.5.82/samv71b/edc/ATSAMV71N21B.PIC
      <edc:SFRDef edc:_addr="0x40068094" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MLB_HCER1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CERR" edc:desc="Bitwise Channel Error Bit [31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40068098" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MLB_HCBR0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHB" edc:desc="Bitwise Channel Busy Bit [31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4006809C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="MLB_HCBR1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHB" edc:desc="Bitwise Channel Busy Bit [31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400680A0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x400680C0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDAT0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="CRT or DBR Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680C4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDAT1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="CRT or DBR Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680C8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDAT2" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="CRT or DBR Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680CC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDAT3" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="CRT or DBR Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680D0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDWE0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Bitwise Write Enable for CTR Data - bits[31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDWE1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Bitwise Write Enable for CTR Data - bits[31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680D8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDWE2" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Bitwise Write Enable for CTR Data - bits[31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680DC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_MDWE3" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="MASK" edc:desc="Bitwise Write Enable for CTR Data - bits[31:0]" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680E0" edc:access="-------------------------------n" edc:cname="MLB_MCTL" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="XCMP" edc:desc="Transfer Complete (Write 0 to Clear)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400680E4" edc:access="nn----------------nnnnnnnnnnnnnn" edc:cname="MLB_MADR" edc:impl="0xC0003FFF" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="CTR or DBR Address" edc:nzwidth="0xE"/>
            <edc:AdjustPoint edc:offset="0x10"/>
            <edc:SFRFieldDef edc:cname="TB" edc:desc="Target Location Bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="CTR" edc:desc="Selects CTR" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DBR" edc:desc="Selects DBR" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WNR" edc:desc="Write-Not-Read Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400680E8" edc:offset="0x2D8"/>
      <edc:SFRDef edc:_addr="0x400683C0" edc:access="---------------------------n-nnn" edc:cname="MLB_ACTL" edc:impl="0x17" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="SCE" edc:desc="Software Clear Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMX" edc:desc="AHB Interrupt Mux Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA_MODE" edc:desc="DMA Mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="MPB" edc:desc="DMA Packet Buffering Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SINGLE_PACKET" edc:desc="Single-packet mode" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MULTIPLE_PACKET" edc:desc="Multiple-packet mode" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400683C4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x400683D0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_ACSR0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHS" edc:desc="Interrupt Status for Logical Channels [31:0] (cleared by writing a 1)" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400683D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_ACSR1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHS" edc:desc="Interrupt Status for Logical Channels [31:0] (cleared by writing a 1)" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400683D8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_ACMR0" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHM" edc:desc="Bitwise Channel Mask Bits 31 to 0" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400683DC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MLB_ACMR1" edc:nzwidth="0x20" ltx:memberofperipheral="MLB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MLB">
            <edc:SFRFieldDef edc:cname="CHM" edc:desc="Bitwise Channel Mask Bits 31 to 0" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400683E0" edc:offset="0x3C20"/>
      <edc:SFRDef edc:_addr="0x4006C000" edc:access="---------------w-------w-------w" edc:cname="AES_CR" edc:impl="0x10101" edc:nzwidth="0x20" ltx:memberofperipheral="AES">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AES">
            <edc:SFRFieldDef edc:cname="START" edc:desc="Start Processing" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="LOADSEED" edc:desc="Random Number Generator Seed Loading" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
