Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.5.82/samv71b/edc/ATSAMV71N21B.PIC
      <edc:DCRDef edc:_addr="0xC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="LOCKBIT_WORD3" edc:factorydefault="0x0" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="LOCKBIT">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="LOCKBIT">
            <edc:DCRFieldDef edc:cname="LOCK_REGION_96" edc:desc="Lock Region 96" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_97" edc:desc="Lock Region 97" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_98" edc:desc="Lock Region 98" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_99" edc:desc="Lock Region 99" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_100" edc:desc="Lock Region 100" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_101" edc:desc="Lock Region 101" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_102" edc:desc="Lock Region 102" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_103" edc:desc="Lock Region 103" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_104" edc:desc="Lock Region 104" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_105" edc:desc="Lock Region 105" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_106" edc:desc="Lock Region 106" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_107" edc:desc="Lock Region 107" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_108" edc:desc="Lock Region 108" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_109" edc:desc="Lock Region 109" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_110" edc:desc="Lock Region 110" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_111" edc:desc="Lock Region 111" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_112" edc:desc="Lock Region 112" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_113" edc:desc="Lock Region 113" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_114" edc:desc="Lock Region 114" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_115" edc:desc="Lock Region 115" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_116" edc:desc="Lock Region 116" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_117" edc:desc="Lock Region 117" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_118" edc:desc="Lock Region 118" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_119" edc:desc="Lock Region 119" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_120" edc:desc="Lock Region 120" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_121" edc:desc="Lock Region 121" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_122" edc:desc="Lock Region 122" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_123" edc:desc="Lock Region 123" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_124" edc:desc="Lock Region 124" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_125" edc:desc="Lock Region 125" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_126" edc:desc="Lock Region 126" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LOCK_REGION_127" edc:desc="Lock Region 127" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:LockbitsSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="TIOA0" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="MCK" edc:ppsfunction="D" ltx:memberofperipheral="I2SC0"/>
      <edc:VirtualPin edc:name="WKUP0" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="TIOB0" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="CK" edc:ppsfunction="D" ltx:memberofperipheral="I2SC0"/>
      <edc:VirtualPin edc:name="WKUP1" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="DATRG" edc:ppsfunction="C" ltx:memberofperipheral="DACC"/>
      <edc:VirtualPin edc:name="WKUP2" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="TWD0" edc:ppsfunction="A" ltx:memberofperipheral="TWIHS0"/>
      <edc:VirtualPin edc:name="LONCOL1" edc:ppsfunction="B" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="PIODC0" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA4" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="TWCK0" edc:ppsfunction="A" ltx:memberofperipheral="TWIHS0"/>
      <edc:VirtualPin edc:name="TCLK0" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="C" ltx:memberofperipheral="UART1"/>
      <edc:VirtualPin edc:name="PIODC1" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="WKUP3" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA5" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="D4" edc:ppsfunction="B" ltx:memberofperipheral="ISI"/>
      <edc:VirtualPin edc:name="URXD1" edc:ppsfunction="C" ltx:memberofperipheral="UART1"/>
      <edc:VirtualPin edc:name="PIODC2" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="WKUP4" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="XIN32" edc:ppsfunction="X1" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA8" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="B" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="XOUT32" edc:ppsfunction="X1" ltx:memberofperipheral="PMC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA9" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="URXD0" edc:ppsfunction="A" ltx:memberofperipheral="UART0"/>
      <edc:VirtualPin edc:name="D3" edc:ppsfunction="B" ltx:memberofperipheral="ISI"/>
      <edc:VirtualPin edc:name="PWMFI0" edc:ppsfunction="C" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PIODC3" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="WKUP6" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="UTXD0" edc:ppsfunction="A" ltx:memberofperipheral="UART0"/>
      <edc:VirtualPin edc:name="PWMEXTRG0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="RD" edc:ppsfunction="C" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="PIODC4" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA11" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QCS" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PIODC5" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="WKUP7" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QIO1" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PIODC6" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QIO0" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PIODC7" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QSCK" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PIODCEN1" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="WKUP8" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="TIOA1" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="C" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="WS" edc:ppsfunction="D" ltx:memberofperipheral="I2SC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="TIOB1" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="C" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="DI0" edc:ppsfunction="D" ltx:memberofperipheral="I2SC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="QIO2" edc:ppsfunction="A" ltx:memberofperipheral="QSPI"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="C" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="AD6" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWMEXTRG1" edc:ppsfunction="A" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="AD7" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="AD8" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="WKUP9" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="AD9" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="WKUP10" edc:ppsfunction="X1" ltx:memberofperipheral="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RXD1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B" ltx:memberofperipheral="PMC"/>
      <edc:VirtualPin edc:name="PWMFI0" edc:ppsfunction="C" ltx:memberofperipheral="PWM1"/>
      <edc:VirtualPin edc:name="AD1" edc:ppsfunction="X1" ltx:memberofperipheral="AFEC0"/>
      <edc:VirtualPin edc:name="PIODCEN2" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RK" edc:ppsfunction="A" ltx:memberofperipheral="SSC"/>
      <edc:VirtualPin edc:name="PWMEXTRG1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PIODCCLK" edc:ppsfunction="X1" ltx:memberofperipheral="PIOA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="SCK1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="D" ltx:memberofperipheral="PWM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="RTS1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="PCK" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="CTS1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B" ltx:memberofperipheral="PWM0"/>
      <edc:VirtualPin edc:name="MCCK" edc:ppsfunction="D" ltx:memberofperipheral="HSMCI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA26" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="DCD1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="TIOA2" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="MCDA2" edc:ppsfunction="C" ltx:memberofperipheral="HSMCI"/>
      <edc:VirtualPin edc:name="PWMFI1" edc:ppsfunction="D" ltx:memberofperipheral="PWM1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="DTR1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="TIOB2" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="MCDA3" edc:ppsfunction="C" ltx:memberofperipheral="HSMCI"/>
      <edc:VirtualPin edc:name="D7" edc:ppsfunction="D" ltx:memberofperipheral="ISI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA28" edc:ppsfunction="default" ltx:memberofperipheral="PIOA"/>
      <edc:VirtualPin edc:name="DSR1" edc:ppsfunction="A" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="TCLK1" edc:ppsfunction="B" ltx:memberofperipheral="TC0"/>
      <edc:VirtualPin edc:name="MCCDA" edc:ppsfunction="C" ltx:memberofperipheral="HSMCI"/>
      <edc:VirtualPin edc:name="PWMFI2" edc:ppsfunction="D" ltx:memberofperipheral="PWM1"/>
    </edc:Pin>
